const a = 1;
const b = 1;

console.log((a + b).toString(2));

//---------------------------------------------------------------------------------------------------------------------
/*
Implement a function that adds two numbers together and returns their sum in binary. The conversion can be done before, or after the addition.

The binary number returned should be a string.

Examples:(Input1, Input2 --> Output (explanation)))

1, 1 --> "10" (1 + 1 = 2 in decimal or 10 in binary)
5, 9 --> "1110" (5 + 9 = 14 in decimal or 1110 in binary)
*/
/*
Реалізуйте функцію, яка додає два числа разом і повертає їх суму в двійковому вигляді. Перетворення можна виконати до або після додавання.

Повернене двійкове число має бути рядком.

Приклади:(Вхід1, Вхід2 --> Вихід (пояснення)))

1, 1 --> "10" (1 + 1 = 2 у десятковій чи 10 у двійковій)
5, 9 --> "1110" (5 + 9 = 14 у десятковій чи 1110 у двійковій)
*/
//---------------------------------------------------------------------------------------------------------------------
